# HPerim

## Description
Function HPerim returns the perimeter of the referenced object.&lt;BR&gt;
&lt;BR&gt;
&lt;BR&gt;

```pascal
FUNCTION HPerim(h : HANDLE) : REAL;
```

```python

def vs.HPerim(h):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|

## Version
Availability: from MiniCAD
## Category
* Object Info